[{"_id":1,"name":"Robinson Crusoe Adventures on the Cursed Island","description":"Robinson Crusoe: Adventures on the Cursed Island is a game created by Ignacy Trzewiczek, the author of Stronghold. This time Trzewiczek takes the players to a deserted island, where they'll play the parts of shipwreck survivors confronted by an extraordinary adventure. They'll be faced with the challenges of building a shelter, finding food, fighting wild beasts, and protecting themselves from weather changes. Building walls around their homes, animal domestication, constructing weapons and tools from what they find and much more awaits them on the island. The players decide in which direction the game will unfold and - after several in-game weeks of hard work - how their settlement will look. Will they manage to discover the secret of the island in the meantime? Will they find a pirate treasure, or an abandoned village? Will they discover an underground city or a cursed temple at the bottom of a volcano? Answers to these questions lie in hundreds of event cards and hundreds of object and structure cards that can be used during the game...","publish_date":"2012-06-20T22:00:00.000Z","categories":["thematic","cooperative"],"rating":8.08},{"_id":2,"name":"Battlestar Galactica","description":"Battlestar Galactica: The Board Game is an exciting game of mistrust, intrigue, and the struggle for survival. Based on the epic and widely-acclaimed Sci Fi Channel series, Battlestar Galactica: The Board Game puts players in the role of one of ten of their favorite characters from the show. Each playable character has their own abilities and weaknesses, and must all work together in order for humanity to have any hope of survival. However, one or more players in every game secretly side with the Cylons. Players must attempt to expose the traitor while fuel shortages, food contaminations, and political unrest threatens to tear the fleet apart. After the Cylon attack on the Colonies, the battered remnants of the human race are on the run, constantly searching for the next signpost on the road to Earth. They face the threat of Cylon attack from without, and treachery and crisis from within. Humanity must work together if they are to have any hope of survival_but how can they, when any of them may, in fact, be a Cylon agent?","publish_date":"2008-02-19T00:00:00.000Z","categories":["thematic"],"rating":7.82},{"_id":3,"name":"Twilight Imperium","description":"Twilight Imperium Third Edition is an epic empire-building game of interstellar conflict, trade, and struggle for power. Players take the roles of ancient galactic civilizations, each seeking to seize the imperial throne via warfare, diplomacy, and technological progression. With geomorphic board tiles, exquisite plastic miniatures, hundreds of cards, and introducing a rich set of strategic dimensions that allows each player to refocus their game-plan, the original designer Christian T. Petersen has seamlessly incorporated the better qualities of other recently popular games to improve on the game-play of the original TI, making it at once perfectly well-rounded and pleasantly familiar to experienced gamers.","publish_date":"2005-03-17T00:00:00.000Z","categories":["strategy","thematic","abstract"],"rating":7.89},{"_id":4,"name":"War of the Ring","description":"In War of the Ring, one player takes control of the Free Peoples (FP), the other player controls Shadow Armies (SA). Initially, the Free People Nations are reluctant to take arms against Sauron, so they must be attacked by Sauron or persuaded by Gandalf or other Companions, before they start to fight properly: this is represented by the Political Track, which shows if a Nation is ready to fight in the War of the Ring or not. The game can be won by a military victory, if Sauron conquers a certain number of Free People cities and strongholds or vice-versa. But the true hope of the Free Peoples lies with the quest of the Ringbearer: while the armies clash across Middle Earth, the Fellowship of the Ring is trying to get secretly to Mount Doom to destroy the One Ring. Sauron is not aware of the real intention of his enemies but is looking across Middle Earth for the precious Ring, so that the Fellowship is going to face numerous dangers, represented by the rules of The Hunt for the Ring. But the Companions can spur the Free Peoples to the fight against Sauron, so the Free People player must balance the need to protect the Ringbearer from harm, against the attempt to raise a proper defense against the armies of the Shadow, so that they do not overrun Middle Earth before the Ringbearer completes his quest. Each game turn revolves around the roll of Action Dice: each die corresponds to an action that a player can do during a turn. Depending on the face rolled on each die, different actions are possible (moving armies, characters, recruiting troops, advancing a Political Track). Action dice can also be used to draw or play Event Cards. Event Cards are played to represent specific events from the story (or events that could possibly have happened) that cannot be portrayed through normal gameplay. Each Event Card can also create an unexpected turn in the game, allowing special actions or altering the course of a battle.","publish_date":"2004-09-02T00:00:00.000Z","categories":["thematic","wargames"],"rating":7.85},{"_id":5,"name":"Runewars","description":"Runewars is an epic board game of conquest, adventure, and fantasy empires for two to four players. Runewars pits players against each other in a strategic game of battles and area control, where they must gather resources, raise armies, and lay siege to heavily fortified cities. Runewars takes place in the same popular fantasy universe as the board games Runebound, Descent: Journeys in the Dark and Rune Age, and dozens of fan-favorite heroes and monsters play their part. The wars for the dragon runes are beginning, and only one faction will emerge victorious.","publish_date":"2010-10-12T00:00:00.000Z","categories":["strategy","thematic"],"rating":7.75},{"_id":6,"name":"Dune","description":"Set thousands of years in the future, Dune the boardgame is based on the Frank Herbert novels about an arid planet at the heart of the human space empire's political machinations. Designed by the creators at Eon of Cosmic Encounter fame, some contend that the game can best be described as Cosmic Encounter set within the Dune universe, but the two games bear little in common in the actual mechanics or goals; they're just both set in space. Like Cosmic Encounter, it is a game that generates a lot of player interaction through negotiation and bluffing, but that can be said of numerous unrelated games. Players each take the role of one of the factions attempting to control Dune. Each faction has special powers that overlook certain rules in the game. Each turn players move about the map attempting to pick up valuable spice while dealing with giant sandworms, deadly storms, and other players' military forces. A delicate political balance is formed amongst the factions to prevent any one side from becoming too strong. When a challenge is made in a territory, combat takes the form of hidden bids with additional treachery cards to further the uncertainty. The game concludes when one faction (or two allied factions) is able to control a certain number of strongholds on the planet.","publish_date":"1979-06-23T00:00:00.000Z","categories":["strategy","thematic"],"rating":7.62},{"_id":7,"name":"StarCraft The Board Game","description":"Including a total of 180 plastic figures and dozens of unit types, Starcraft: The Board Game features an innovative modular board of varying sizes, which guarantees a new experience each and every game. An exciting card driven combat system allows players to modify and upgrade their faction with a wealth of powerful technologies. Players can unleash a Zergling rush, use powerful Protoss shields to halt an enemy invasion, or even send cloaked Ghosts out to guide nuclear missiles to their target.","publish_date":"2007-12-02T00:00:00.000Z","categories":["strategy","thematic"],"rating":7.34},{"_id":8,"name":"1066 End of the Dark Ages","description":"1066: End of the Dark Ages is a wargame of intermediate complexity, designed by Joseph Miranda, simulating the historic struggle to gain control of Britain during that crucial year of the 11th century. That struggle saw the Anglo-Saxons, under King Harold, defeat the Vikings, only to in turn be defeated by the Normans from France led by Duke William. His victory eventually led to the establishment of the modern British nation. 1066: End of the Dark Ages can be played by two, three or four, each representing a different side: Anglo-Saxons, Normans, Vikings and Britons (the latter representing an amalgamation of the various peoples then indigenous to the island).","publish_date":"2006-08-20T00:00:00.000Z","categories":["wargames"],"rating":6.11},{"_id":9,"name":"100 Years War Anglo Vs French","description":"Anglo-French 100 Years War is a simple war game that uses 120 counters and area-based movement to simulate the Hundred Years war.","publish_date":"2001-07-15T00:00:00.000Z","categories":["wargames"],"rating":7.2},{"_id":10,"name":"13 The Colonies in Revolt","description":"This game is an operational simulation of the American Revolutionary War from late 1775 (the siege of Boston and the two Canadian expeditions) through the end of 1781. The British player must try to stop the revolt by trying to control half a continent. Included are a 16 page rulebook, 22X34 map, 200 counters, and various player charts and tables. The British player wins in one of two ways. If the year is 1775 or 1776, the British player requires control of a limited number of objectives (Canada, Boston, New York, Philadelphia, Charleston, and one area of operations). If the game continues to 1781, the British player must control New England, the Middle Colonies, the South, and either Canada or the Western Territories. If the British do not attain these objectives, the American player wins.","publish_date":"1985-02-01T00:00:00.000Z","categories":["wargames"],"rating":5.7},{"_id":11,"name":"1-48 Combat","description":"Squad-level tactical WWII miniatures skirmish game. Units are individual soldiers, and the rules support up to company-level actions. The initial release will consist of 12 different unpainted 32mm miniatures representing soldiers from the German and Russian armies at Stalingrad. Each piece will be individually packaged with its own stats card, game tokens, and a resin scenic piece. The unique scenic base can be used as cover in the game, but the pieces also fit into it, turning each soldier into a mini-diorama as well. Measurements are in generic units, so the rules are suitable for any scale, and can be downloaded free from the company's website at for use with other WWII miniatures. Rules for larger forces, multiplayer games and armoured support are in development.","publish_date":"2009-05-25T00:00:00.000Z","categories":["wargames"],"rating":7.17},{"_id":12,"name":"1812 The Invasion of Canada","description":"The year is 1812. War is raging across Europe and Russia. Napoleon, emperor of France, is seeking to dominate Europe through conquest. France's enemies, led by England, are engaged in a desperate struggle to defeat Napoleon. England, in dire need of men, is impressing men to serve in its navy. Included are Americans who are pressed into service at gunpoint.","publish_date":"2012-04-13T00:00:00.000Z","categories":["strategy","wargames","abstract"],"rating":7.42},{"_id":13,"name":"Beowulf The Movie Board Game","description":"Beowulf: The Movie Board Game is a reimplementation of Reiner Knizia's Kingdoms. It's also not to be confused with the same author's Beowulf: The Legend. It's an abstract strategy clothed in a theme based on the movie directed by Robert Zemeckis. The players' goal is to score the most victory points by clever tile and figurine placement on the board, composed of squares arranged in a grid. Its layout is changed, as the game is divided into three chapters that feature slightly different sets of tiles that can be drawn. Clever hand management (of tiles and figurines) is also important in the game, as some of them can be used only once throughout the entire game.","publish_date":"2007-08-09T00:00:00.000Z","categories":["strategy"],"rating":6.4},{"_id":14,"name":"1066 The Battle of Hastings in 3D","description":"William Duke of Normandy has invaded England to claim the throne with his Norman army, the only thing that is stopping him is Harold the Saxon King of England and his army that as just fought and won the battle of Stamford Bridge.","publish_date":"2007-05-17T00:00:00.000Z","categories":["wargames"],"rating":7.25},{"_id":15,"name":"Cthulhu Wars","description":"Cthulhu Wars is a strategy boardgame in which the players take the part of alien races and gods taken from the Cthulhu mythos created by H. P. Lovecraft. The game is physically large, and includes sixty-four figurines of the cultists, monsters, aliens, and Great Old Ones that range in height from approximately 20 mm to nearly 180 mm. The game takes place on a map of Earth. Each player takes the part of one of four factions included in the base game. At the start of a turn, players Gather Power, then, during a series of Action Rounds, they spend this Power to accomplish various tasks, such as recruiting Cultists, moving units, engaging in battle, summoning monsters, building Gates, casting spells, and Awakening their Great Old One. When all players run out of Power, the Action phase ends and the next turn begins. Victory is determined by accumulating points on the Doom Track. The first player to 30 is the lone victor *if* he has unlocked all six of spell books. Driving the strategy are a player's wish to expand his power base, and his need to accomplish six tasks to acquire his faction's spell books. Each faction has a unique set of monsters, spell books, and special abilities, and has different requirements to acquire its spell books. All factions have multiple strategies open to them. The base game supports 2-4 players (the map supports 5 players), but with new factions and maps released as expansions it can support up to 7 players.","publish_date":"2015-09-17T00:00:00.000Z","categories":["strategy","thematic"],"rating":8.17},{"_id":16,"name":"Smash Up","description":"The 'shufflebuilding' game Smash Up starts with a simple premise: Take the twenty-card decks of two factions, shuffle them into a forty-card deck, then compete to smash more Bases than your opponents! Each faction brings a different game mechanism into play - pirates move cards, zombies bring cards back from the discard pile, dinosaurs have huge power - and every combination of factions brings a different play experience. During play, Base cards (each with their own difficulties and abilities) are in play. You attempt to have the most power on the Base from your minions when the Base is smashed. Sounds easy? How easy is it when an opponent's Alien-Ninja decides to Beam Up your minions to other Bases - flat out Assassinate them? What about when the Pirate-Dinosaur player Full Sails in and releases King Rex to stomp your minions into the ground, or when the Wizard-Zombies use their Mystic Power to create an Outbreak, suddenly flooding minions onto the Base from the discard pile? Or what if you faced a Zombie-Dinosaur player instead and he created an Outbreak of massive beasts all at once?!? When a Base is smashed, each player in first, second and third place scores points. Fourth place? Sorry, bro - try harder next time. With eight different factions, Smash Up includes dozens of combinations to try. Pirate-Aliens play different than Ninja-Aliens, for instance. Which will you use to smash up your opponents? And did we mention the dinosaurs have laser beams?","publish_date":"2012-01-12T00:00:00.000Z","categories":["strategy"],"rating":6.97},{"_id":17,"name":"Star Realms","description":"Star Realms is a spaceship combat deck-building game by Magic Hall of Famers Darwin Kastle (Battle for Hill 218) and Rob Dougherty (Ascension Co-designer). Star Realms is a fast paced deck-building card game of outer space combat. It combines the fun of a deck-building game with the interactivity of Trading Card Game style combat. As you play, you make use of Trade to acquire new Ships and Bases from the cards being turned face up in the Trade Row from the Trade Deck. You use the Ships and Bases you acquire to either generate more Trade or to generate Combat to attack your opponent and their bases. When you reduce your opponent's score (called Authority) to zero, you win! With multiple decks of Star Realms, one for each two people, you can play scenarios that allow for up to six players.","publish_date":"2014-06-19T00:00:00.000Z","categories":["strategy"],"rating":7.72},{"_id":18,"name":"Quarriors","description":"Players take on the roles of Quarriors - mighty mystical warriors who have the power to capture dangerous quarry from the untamed Wilds! They must conjure the mysterious powers of Quiddity, cast powerful spells, and summon their creatures to battle if they hope to overcome rivals and earn their rightful place as the Champion! Quarriors has the frenetic excitement of a dice battle game, with an added 'deckbuilding' twist: players customize their dice pools during the game using resources generated by their rolls. Quarriors takes the best of deckbuilding games without the tedium of shuffling. Take a typical deckbuilding game, add the speed and fun of dice and in 60 minutes you're on your second or third game trying unique strategies against your opponents.","publish_date":"2011-10-29T00:00:00.000Z","categories":["strategy"],"rating":6.89},{"_id":19,"name":"Monopoly Star Wars","description":"Monopoly Star Wars style. In this version of Monopoly players must buy up property and build homes in the Star Wars universe.","publish_date":"1997-10-29T00:00:00.000Z","categories":["strategy","thematic"],"rating":4.98},{"_id":20,"name":"Through the Ages A Story of Civilization","description":"Through the Ages is a civilization building game. Each player attempts to build the best civilization through careful resource management, discovering new technologies, electing the right leaders, building wonders and maintaining a strong military. Weakness in any area can be exploited by your opponents. The game takes place throughout the ages beginning in the age of antiquity and ending in the modern age. One of the primary mechanisms in TTA is card drafting. Technologies, wonders, and leaders come into play and become easier to draft the longer they are in play. In order to use a technology you will need enough science to discover it, enough food to create a population to man it and enough resources (ore) to build the building to use it. While balancing the resources needed to advance your technology you also need to build a military. Military is built in the same way as civilian buildings. Players that have a weak military will be preyed upon by other players. There is no map in the game so you cannot lose territory, but players with higher military will steal resources, science, kill leaders, take population or culture. It is very difficult to win with a large military, but it is very easy to lose because of a weak one. Victory is achieved by the player whose nation has the most culture at the end of the modern age.","publish_date":"2006-02-07T00:00:00.000Z","categories":["strategy"],"rating":8.2},{"_id":21,"name":"fadfafafs","description":"fsaasfbfshafsfffsaasbvfhuvahfiasvhfksabvfhaskbfsahkfbsahfkabsfsahfvafvasfs","publish_date":"2022-04-17T22:00:00.000Z","categories":["thematic"],"rating":null}]